[
  {
    "article_id": "6070f5ce6ea9ad4839aad559a29b1d16",
    "source": "Cointelegraph",
    "title": "Federal taxes to be &#039;substantially reduced&#039; once tariffs set in: Trump",
    "url": "https://cointelegraph.com/news/federal-taxes-significantly-reduced-tariffs-set-trump?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "description": "United States President Donald Trump recently said that federal income taxes would be \"substantially reduced\" or potentially eliminated once the tariff regime fully sets in.In an April 27 Truth Social post, Trump added that the focus of the purported tax cuts would be on individuals making less than $200,000 per year.The US President also said that the \"External Revenue Service\" — a reference to funding the federal government exclusively through import tariffs instead of the current model of collecting taxes through the Internal Revenue Service (IRS) — is materializing.Eliminating the federal income tax would likely be a positive catalyst for asset prices, including cryptocurrencies, as the increase in disposable income should partially flow back into productive investments. However, this stimulative effect is not guaranteed.Source: Donald TrumpRelated: If Trump fired Powell, what would happen to crypto?Trump’s plan leaves analysts and markets doubtingTrump previously floated the idea of eliminating the federal income tax in an October 2024 appearance on the Joe Rogan Experience, although Trump, who was on the campaign trail at the time, provided scant concrete details on the proposal.The US President suggested that replacing the federal income tax with revenue from import duties would return the US to a time of prosperity seen during the Gilded Age, in the 19th century, when the US did not have a permanent federal income tax.Research conducted by accounting automation company Dancing Numbers found that Trump's proposal could save the average American $134,809 in lifetime tax payments.Dancing Numbers added that the tax savings could be as much as $325,561 per American if other wage-based income taxes are also eliminated.On April 2, Trump signed an executive order imposing sweeping tariffs on all US trading partners, which included a 10% baseline tariff on all countries and different \"reciprocal\" tariff rates on countries with import duties on US goods.However, since that time, the Trump administration walked back its tariff policies several times, flip-flopping on tariff rates and when the tariff regime would fully take effect.The Trump administration's ever-changing rhetoric surrounding trade policies has heightened volatility in the US stock market, caused a rise in US bond yields, and has drawn widespread criticism from financial analysts who say the protectionist trade policies hurt capital markets while achieving little else.Magazine: Harris’ unrealized gains tax could ‘tank markets’: Nansen’s Alex Svanevik, X Hall of Flame\n",
    "content": "",
    "published_at": "2025-04-27T18:25:32+01:00",
    "author": "Cointelegraph by Vince Quill",
    "image_url": "https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDQvMDE5Njc3YzMtYjVjMy03NjUyLWFiMDQtMWE4N2NkZTgxODE3.jpg",
    "tags": [],
    "collected_at": "2025-04-28T00:27:29.028400"
  },
  {
    "article_id": "9a20022f39d788d397d3d8a86746f232",
    "source": "Cointelegraph",
    "title": "The cost of innovation — Regulations are Web3’s greatest asset",
    "url": "https://cointelegraph.com/news/regulations-are-web3-s-greatest-asset?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "description": "Opinion by: Hedi Navazan, chief compliance officer at 1inchWeb3 needs a clear regulatory system that addresses innovation bottlenecks and user safety in decentralized finance (DeFi). A one-size-fits-all approach cannot be achieved to regulate DeFi. The industry needs custom, risk-based approaches that balance innovation, security and compliance.DeFi’s challenges and rulesA common critique is that regulatory scrutiny leads to the death of innovation, tracing this situation back to the Biden administration. In 2022, uncertainty for crypto businesses increased following lawsuits against Coinbase, Binance and OpenSea for alleged violations of securities laws.Under the US administration, the Securities and Exchange Commission agreed to dismiss the lawsuit against Coinbase, as the agency reversed the crypto stance, hinting at a path toward regulation with clear boundaries.Many would argue that the same risk is the same rule. Imposing traditional finance requirements on DeFi simply will not work from many aspects but the most technical challenges.Openness, transparency, immutability, and automation are key parameters of DeFi. Without clear regulations, however, the prevalent issue of “Ponzi-like schemes” can divert focus from effective innovation use cases to conjuring a “deceptive perception” of blockchain technology. Guidance and clarity from regulatory bodies can reduce significant risks for retail users.Policymakers should take time to understand DeFi’s architecture before introducing restrictive measures. DeFi needs risk-based regulatory models that understand its architecture and address illicit activity and consumer protection. Self-regulatory frameworks cultivate transparency and security in DeFiThe entire industry highly recommends implementing a self-regulatory framework that ensures continuous innovation while simultaneously ensuring consumer safety and financial transparency. Take the example of DeFi platforms that have taken a self-regulatory approach by implementing robust security measures, including transaction monitoring, wallet screening and implementing a blacklist mechanism that restricts a wallet of suspicion with illicit activity. Sound security measures would help DeFi projects monitor onchain activity and prevent system misuse. Self-regulation can help DeFi projects operate with greater legitimacy, yet it may not be the only solution.Clear structure and governance are keyIt’s no secret that institutional players are waiting for the regulatory green light. Adding to the list of regulatory frameworks, Markets in Crypto-Assets (MiCA) sets stepping stones for future DeFi regulations that can lead to institutional adoption of DeFi. It provides businesses with regulatory clarity and a framework to operate.Many crypto projects will struggle and die as a result of higher compliance costs associated with MiCA, which will enforce a more reliable ecosystem by requiring augmented transparency from issuers and quickly attract institutional capital for innovation. Clear regulations will lead to more investments in projects that support investor trust.Anonymity in crypto is quickly disappearing. Blockchain analytics tools, regulators and companies can monitor suspicious activity while preserving user privacy to some extent. Future adaptations of MiCA regulations can enable compliance-focused DeFi solutions, such as compliant liquidity pools and blockchain-based identity verification.Regulatory clarity can break barriers to DeFi integrationThe banks’ iron gate has been another significant barrier. Compliance officers frequently witness banks erect walls to keep crypto out. Bank supervisors distance companies that are out of compliance, even if it’s indirect scrutiny or fines, slamming doors on crypto projects’ financial operations. Clear regulations will address this issue and make compliance a facilitator, not a barrier, for DeFi and banking integration. In the future, traditional banks will integrate DeFi. Institutions will not replace banks but will merge DeFi’s efficiencies with TradFi’s structure.Recent: Hester Peirce calls for SEC rulemaking to ‘bake in’ crypto regulationThe repeal of Staff Accounting Bulletin (SAB) 121 in January 2025 mitigated accounting burdens for banks to recognize crypto assets held for customers as both assets and liabilities on their balance sheets. The previous laws created hurdles of increased capital reserve requirements and other regulatory challenges.SAB 122 aims to provide structured solutions from reactive compliance to proactive financial integration — a step toward creating DeFi and banking synergy. Crypto companies must still follow accounting principles and disclosure requirements to protect crypto assets. Clear regulations can increase the frequency of banking use cases, such as custody, reserve backing, asset tokenization, stablecoin issuance and offering accounts to digital asset businesses.Building bridges between regulators and innovators in DeFiExperts pointing out concerns about DeFi’s over-regulation killing innovation can now address them using “regulatory sandboxes.” These dispense startups with a “secure zone” to test their products before committing to full-scale regulatory mandates. For example, startups in the United Kingdom under the Financial Conduct Authority are thriving using this “trial and error” method that has accelerated innovation.These have enabled businesses to test innovation and business models in a real-world setting under regulator supervision. Sandboxes could be accessible to licensed entities, unregulated startups or companies outside the financial services sector.Similarly, the European Union’s DLT Pilot Regime advances innovation and competition, encouraging market entry for startups by reducing upfront compliance costs through “gates” that align legal frameworks at each level while upgrading technological innovation.Clear regulations can cultivate and support innovation through open dialogue between regulators and innovators.Opinion by: Hedi Navazan, chief compliance officer at 1inch.This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n",
    "content": "",
    "published_at": "2025-04-27T16:00:00+01:00",
    "author": "Cointelegraph by Hedi Navazan",
    "image_url": "https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDMvMDE5NWQ3NzctZjI5NC03MWQ1LTk4NWUtNWRkNmNmMjFlNDE2.jpg",
    "tags": [],
    "collected_at": "2025-04-28T00:27:29.034398"
  },
  {
    "article_id": "eac8480d5ad27b965fadb10f8c2c82c8",
    "source": "Cointelegraph",
    "title": "Michael Saylor hints at Bitcoin purchase as whales stack aggressively",
    "url": "https://cointelegraph.com/news/michael-saylor-hints-bitcoin-purchase-whales-stack-aggressively?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "description": "Whales and large institutions continue their aggressive Bitcoin accumulation, with Strategy hinting at another Bitcoin investment that may be announced on Monday.Strategy co-founder Michael Saylor hinted at another imminent Bitcoin (BTC) investment on April 27, a week after the firm acquired $555 million worth of Bitcoin at an average price of $84,785 per coin.“Stay Humble. Stack Sats,” Saylor wrote, spurring investor speculation of the size of the firm’s next Bitcoin investment.Source: Michael Saylor“1.4-1.6b range imo,” wrote popular blockchain analyst RunnerXBT in anticipation of Saylor’s announcement, which would make it three times as large as Strategy’s previous investment.Related: Bitcoin treasury firms driving $200T hyperbitcoinization — Adam BackStrategy is the world’s largest corporate Bitcoin holder with over 538,200 Bitcoin worth over $50.5 billion, Bitbo data shows.The 10 largest Bitcoin holding companies. Source: BitboThe firm’s investment philosophy inspired other companies to adopt Bitcoin, including Japanese investment firm Metaplanet, which surpassed 5,000 BTC holdings on April 24, in an effort to lead Bitcoin adoption in Asia.Related: Trump fought the bond market, the bond market won: Saifedean AmmousETFs log $3 billion, and whales aggressively accumulate BitcoinWhales, or large Bitcoin investors, are also accumulating Bitcoin under the $100,000 psychological mark.Whale wallets holding at least $1 million worth of Bitcoin restarted their accumulation at the beginning of April, increasing from 124,000 wallets on April 7 to over 137,600 wallets on April 26, Glassnode data shows.Bitcoin addresses with over $1 million balance. Source: Glassnode The aggressive whale accumulation helped Bitcoin’s recovery to above $94,000, Nexo dispatch analyst Iliya Kalchev told Cointelegraph, adding:“Wallets holding over 10,000 BTC have been aggressively accumulating, with a trend score of 0.90, while smaller investors are also pivoting toward long-term holding.”“Trump confirmed discussions with China are ongoing, with Beijing offering exemptions on select US imports, suggesting a softening tone. Still, markets are awaiting tangible action before re-rating global risk,” he added.Bitcoin exchange-traded fund (ETF) inflows have also contributed to Bitcoin’s near 12% weekly recovery.Bitcoin ETF Flow, USD, million. Source: Farside InvestorsUS spot Bitcoin ETFs recorded over $3 billion worth of cumulative net inflows during the past week, marking their second-highest week of investments since launching, Farside Investors data shows.Magazine: Bitcoin’s odds of June highs, SOL’s $485M outflows, and more: Hodler’s Digest, March 2 – 8\n",
    "content": "",
    "published_at": "2025-04-27T15:27:10+01:00",
    "author": "Cointelegraph by Zoltan Vardai",
    "image_url": "https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTIvMDE5M2YxMTItZjRkYS03NmYzLWFiMzctZjcxNmMwZDM3MjEz.jpg",
    "tags": [],
    "collected_at": "2025-04-28T00:27:29.040396"
  },
  {
    "article_id": "68bc88d77aa694bf0894235bdf0759d2",
    "source": "Cointelegraph",
    "title": "Here’s what happened in crypto today",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "description": "Today in crypto, Adam back said Strategy and other Bitcoin treasury firms are some of the earliest bettors on Hyperbitcoinization, which may see Bitcoin’s market cap soar to above $200 trillion, US Securities and Exchange Commission (SEC) crypto task force head Hester Peirce said crypto in the US is like a game of “the floor is lava,” and tokenized real estate could top $4 trillion by 2035, according to a new Deloitte report.Bitcoin treasury firms driving $200 trillion hyperbitcoinization — Adam BackInvestment firms with Bitcoin-focused treasuries are front-running global Bitcoin adoption, which may see the world’s first cryptocurrency soar to a $200 trillion market capitalization in the coming decade.Institutions and governments worldwide are starting to recognize the unique monetary properties of Bitcoin (BTC), according to Adam Back, co-founder and CEO of Blockstream and the inventor of Hashcash.“$MSTR and other treasury companies are an arbitrage of the dislocation between the bitcoin future and todays fiat world,” Back wrote in an April 26 X post.“A sustainable and scalable $100-$200 trillion trade front-running hyperbitcoinization. scalable enough for most big listed companies to move to btc treasury,” he added.Hyperbitcoinization refers to the theoretical future where Bitcoin soars to become the largest global currency, replacing fiat money due to its inflationary economics and growing distrust in the legacy financial system.Source: Adam BackBitcoin’s price outpacing fiat money inflation remains the main driver of global hyperbitcoinization, Back said, adding:“Some people think treasury strategy is a temporary glitch. i’m saying no it's a logical and sustainable arbitrage. but not for ever, the driver is bitcoin price going up over 4 year periods faster than interest and inflation.”US crypto rules like “floor is lava” game without lights — Hester PeirceSEC Commissioner and head of the crypto task force, Hester Peirce, says US financial firms are navigating crypto in a way that’s similar to playing the children’s game “the floor is lava,” but in the dark.“It is time that we find a way to end this game. We need to turn on the lights and build some walkways over the lava pit,” Peirce said at the SEC “Know Your Custodian” roundtable event on April 25.Peirce explained that SEC registrants are forced to approach crypto-related activities like “the floor is lava,” where the aim is to jump from one piece of furniture to the next without touching the ground, except here, touching crypto directly is the lava. “A D.C. version of this game is our regulatory approach to crypto assets, and crypto asset custody in particular,” she said.Peirce said that, much like in the game, firms wanting to engage with crypto must avoid directly holding it due to unclear regulatory rules. “To engage in crypto-related activities, SEC-registrants have had to hop from one poorly illuminated regulatory space to the next, all while ensuring that they never touch any crypto asset,” Peirce said.Deloitte predicts $4 trillion tokenized real estate on blockchain by 2035Over $4 trillion worth of real estate could be tokenized on blockchain networks during the next decade, potentially offering investors greater access to property ownership opportunities, according to a new report.The Deloitte Center for Financial Services predicts that over $4 trillion worth of real estate may be tokenized by 2035, up from less than $300 billion in 2024. The report, published April 24, estimates a compound annual growth rate (CAGR) of more than 27%.The $4 trillion of tokenized property is predicted to stem from the benefits of blockchain-based assets, as well as a structural shift across real estate and property ownership.Global tokenized real estate value, growth predictions. Source: Deloitte“Real estate itself is undergoing transformation. Post-pandemic work-from-home trends, climate risk, and digitization have reshaped property fundamentals,” according to Chris Yin, co-founder of Plume Network, a blockchain built for real-world assets (RWAs).“Office buildings are being repurposed into AI data centers, logistics hubs and energy-efficient residential communities,” Yin told Cointelegraph.“Investors want targeted access to these modern use cases, and tokenization enables programmable, customizable exposure to such evolving asset profiles,” he said.\n",
    "content": "",
    "published_at": "2025-04-27T14:46:54+01:00",
    "author": "Cointelegraph by Cointelegraph",
    "image_url": "https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjUtMDEvMDE5NDgzZjctMTdlYS03OTc0LWJlNzMtNjYxYzdjZDE1N2M3.jpg",
    "tags": [
      "Trump memecoin",
      "Solana memecoin",
      "TRUMP token",
      "Solana",
      "SOL",
      "Nova Labs",
      "SEC",
      "Securities and Exchange Commission",
      "crypto regulation",
      "TRUMP rally",
      "Bitcoin"
    ],
    "collected_at": "2025-04-28T00:27:29.044394"
  },
  {
    "article_id": "0c6026d1667fd3f811177430dab27f89",
    "source": "Cointelegraph",
    "title": "El Salvador adds Bitcoin, but is complying with IMF deal — Director",
    "url": "https://cointelegraph.com/news/el-salvador-continues-bitcoin-purchases-despite-imf-agreement?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "description": "El Salvador, the world’s first country to adopt Bitcoin as legal tender, is still acquiring Bitcoin despite comments from the International Monetary Fund (IMF) appearing to claim the opposite.The treasury of El Salvador acquired 7 Bitcoin (BTC) worth over $650,000 in the seven days leading up to April 27, blockchain data from El Salvador’s Bitcoin Office shows.When asked about the country’s Bitcoin investments, Rodrigo Valdes, director of the Western Hemisphere Department at the IMF, said that the country continues to comply with its agreement to halt government Bitcoin accumulation.El Salvador Bitcoin holdings. Source: El Salvador Bitcoin Office“In terms of El Salvador, let me say that I can confirm that they continue to comply with their commitment of non-accumulation of Bitcoin by the overall fiscal sector, which is the performance criteria that we have,” said Valdes during an April 26 press briefing.Related: Crypto sentiment recovers, but weekend liquidity risks remain“But on top of that, I think this is very important for the discussion in El Salvador,” he added. “The program of El Salvador is not about Bitcoin. It’s much more, much deeper in structural reforms, in terms of governance, in terms of transparency.”In December 2024, El Salvador struck a deal with the IMF for a $1.4 billion loan, which required the government to drop Bitcoin’s status as a legal tender and stop its BTC accumulation.Related: Serbia’s Prince Filip says Bitcoin is being stifled, expects huge rallyFlexible interpretation leaves room for Bitcoin buysThe IMF’s agreement may still enable room for purchases through non-governmental entities, according to Anndy Lian, author and intergovernmental blockchain adviser.“The IMF’s ‘flexible interpretation’ suggests purchases may involve non-public sector entities or reclassified assets, maintaining technical compliance,” Lian told Cointelegraph, adding:“This alternative approach allows El Salvador to retain its Bitcoin-friendly image while securing critical IMF funding to address unsustainable public debt and limited reserves.”Lian added that El Salvador’s strategy highlights the growing tension between financial innovation and traditional economic policies.“El Salvador’s experience offers valuable lessons for nations exploring crypto adoption, emphasizing the need for robust regulatory frameworks and state capacity to navigate international financial pressures,” he added.Magazine: Altcoin season to hit in Q2? Mantra’s plan to win trust: Hodler’s Digest, April 13 – 19\n",
    "content": "",
    "published_at": "2025-04-27T14:40:49+01:00",
    "author": "Cointelegraph by Zoltan Vardai",
    "image_url": "https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTIvMDE5M2RiZTQtZTQzZS03NjI2LTk5MmEtNzMwMmU3MGFjM2Iw.jpg",
    "tags": [],
    "collected_at": "2025-04-28T00:27:29.047390"
  }
]